Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
#include "InstHandler.h"

#include "StringUtils.h"
#include "../utils/bitMacros.h"

#include "../config.h"

#include "../ATmega32u4.h"
#include "InstInds.h"
#include "../extras/Disassembler.h"

#define MCU_MODULE "InstHandler"

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::callInstSwitch(uint8_t ind, ATmega32u4* mcu, uint16_t word){
	switch(ind) {
		case 0:
			return INST_STS(mcu, word);
		case 1:
			return INST_LDS(mcu, word);
		case 2:
			return INST_POP(mcu, word);
		case 3:
			return INST_PUSH(mcu, word);
		case 4:
			return INST_CALL(mcu, word);
		case 5:
			return INST_LD_X(mcu, word);
		case 6:
			return INST_LD_XpostInc(mcu, word);
		case 7:
			return INST_LD_XpreDec(mcu, word);
		case 8:
			return INST_LD_YpostInc(mcu, word);
		case 9:
			return INST_LD_YpreDec(mcu, word);
		case 10:
			return INST_LD_ZpostInc(mcu, word);
		case 11:
			return INST_LD_ZpreDec(mcu, word);
		case 12:
			return INST_JMP(mcu, word);
		case 13:
			return INST_RET(mcu, word);
		case 14:
			return INST_ADIW(mcu, word);
		case 15:
			return INST_OUT(mcu, word);
		case 16:
			return INST_IN(mcu, word);
		case 17:
			return INST_ROR(mcu, word);
		case 18:
			return INST_DEC(mcu, word);
		case 19:
			return INST_MUL(mcu, word);
		case 20:
			return INST_LPM_0(mcu, word);
		case 21:
			return INST_LPM_d(mcu, word);
		case 22:
			return INST_LPM_dpostInc(mcu, word);
		case 23:
			return INST_SBIW(mcu, word);
		case 24:
			return INST_LSR(mcu, word);
		case 25:
			return INST_ST_X(mcu, word);
		case 26:
			return INST_ST_XpostInc(mcu, word);
		case 27:
			return INST_ST_XpreDec(mcu, word);
		case 28:
			return INST_ST_YpostInc(mcu, word);
		case 29:
			return INST_ST_YpreDec(mcu, word);
		case 30:
			return INST_ST_ZpostInc(mcu, word);
		case 31:
			return INST_ST_ZpreDec(mcu, word);
		case 32:
			return INST_SBI(mcu, word);
		case 33:
			return INST_CBI(mcu, word);
		case 34:
			return INST_COM(mcu, word);
		case 35:
			return INST_CLI(mcu, word);
		case 36:
			return INST_INC(mcu, word);
		case 37:
			return INST_NEG(mcu, word);
		case 38:
			return INST_ASR(mcu, word);
		case 39:
			return INST_ICALL(mcu, word);
		case 40:
			return INST_SBIS(mcu, word);
		case 41:
			return INST_RETI(mcu, word);
		case 42:
			return INST_WDR(mcu, word);
		case 43:
			return INST_SLEEP(mcu, word);
		case 44:
			return INST_SBIC(mcu, word);
		case 45:
			return INST_CLT(mcu, word);
		case 46:
			return INST_SWAP(mcu, word);
		case 47:
			return INST_SEI(mcu, word);
		case 48:
			return INST_SET(mcu, word);
		case 49:
			return INST_SEC(mcu, word);
		case 50:
			return INST_IJMP(mcu, word);
		case 51:
			return INST_EIJMP(mcu, word);
		case 52:
			return INST_EICALL(mcu, word);
		case 53:
			return INST_BSET(mcu, word);
		case 54:
			return INST_BCLR(mcu, word);
		case 55:
			return INST_CLC(mcu, word);
		case 56:
			return INST_SEN(mcu, word);
		case 57:
			return INST_CLN(mcu, word);
		case 58:
			return INST_SEZ(mcu, word);
		case 59:
			return INST_CLZ(mcu, word);
		case 60:
			return INST_SES(mcu, word);
		case 61:
			return INST_CLS(mcu, word);
		case 62:
			return INST_SEV(mcu, word);
		case 63:
			return INST_CLV(mcu, word);
		case 64:
			return INST_SEH(mcu, word);
		case 65:
			return INST_CLH(mcu, word);
		case 66:
			return INST_ELPM_0(mcu, word);
		case 67:
			return INST_ELPM_d(mcu, word);
		case 68:
			return INST_ELPM_dpostInc(mcu, word);
		case 69:
			return INST_SPM(mcu, word);
		case 70:
			return INST_BREAK(mcu, word);
		case 71:
			return INST_LDI(mcu, word);
		case 72:
			return INST_RJMP(mcu, word);
		case 73:
			return INST_MOVW(mcu, word);
		case 74:
			return INST_MOV(mcu, word);
		case 75:
			return INST_ADD(mcu, word);
		case 76:
			return INST_CPC(mcu, word);
		case 77:
			return INST_AND(mcu, word);
		case 78:
			return INST_EOR(mcu, word);
		case 79:
			return INST_SBC(mcu, word);
		case 80:
			return INST_OR(mcu, word);
		case 81:
			return INST_NOP(mcu, word);
		case 82:
			return INST_MULSU(mcu, word);
		case 83:
			return INST_MULS(mcu, word);
		case 84:
			return INST_FMUL(mcu, word);
		case 85:
			return INST_FMULS(mcu, word);
		case 86:
			return INST_FMULSU(mcu, word);
		case 87:
			return INST_BRBS(mcu, word);
		case 88:
			return INST_BRBC(mcu, word);
		case 89:
			return INST_SBRS(mcu, word);
		case 90:
			return INST_SBRC(mcu, word);
		case 91:
			return INST_RCALL(mcu, word);
		case 92:
			return INST_BST(mcu, word);
		case 93:
			return INST_BLD(mcu, word);
		case 94:
			return INST_ADC(mcu, word);
		case 95:
			return INST_CPI(mcu, word);
		case 96:
			return INST_CP(mcu, word);
		case 97:
			return INST_CPSE(mcu, word);
		case 98:
			return INST_SUB(mcu, word);
		case 99:
			return INST_LDD_Y(mcu, word);
		case 100:
			return INST_LDD_Z(mcu, word);
		case 101:
			return INST_LD_Y(mcu, word);
		case 102:
			return INST_LD_Z(mcu, word);
		case 103:
			return INST_STD_Y(mcu, word);
		case 104:
			return INST_STD_Z(mcu, word);
		case 105:
			return INST_ST_Y(mcu, word);
		case 106:
			return INST_ST_Z(mcu, word);
		case 107:
			return INST_SUBI(mcu, word);
		case 108:
			return INST_ANDI(mcu, word);
		case 109:
			return INST_SBCI(mcu, word);
		case 110:
			return INST_ORI(mcu, word);
	}

	return inst_effect_t(0,0);
}


uint8_t A32u4::InstHandler::getInstInd(uint16_t word) noexcept {
	return getInstInd3(word);
}
uint8_t A32u4::InstHandler::getInstInd3(uint16_t word) noexcept {
	static constexpr uint8_t startIndArr[] = { 73, 94, 109, 107, 99, 0, 71, 87 };
	uint8_t startInd = startIndArr[(word & 0b1100000000000000) >> 13 | ((word & 0b0001000000000000) != 0)];

	for (uint8_t i = startInd; i < instListLen; i++) {
		if ((word & instList[i].mask) == instList[i].res) {
			return i;
		}
	}

	//println("Unhaldled Inst: 0x" << std::hex << word); // << " At: 0x" << mcu->cpu.PC

	return 0xff;
}

int16_t convTo16BitInt(uint16_t word, uint8_t bitLen) noexcept { // convert a signed int of arbitrary bitLength to a int16_t
	return isBitSet(word, bitLen - 1) ? (((int16_t)-1 ^ ((1 << bitLen) - 1)) | word) : word;
}
//Parameters
uint8_t A32u4::InstHandler::getRd2_c_arr(uint16_t word) noexcept {//Rd 2Bit continous use as arr index
	constexpr uint8_t arr[] = { 24,26,28,30 };
	return arr[((word & 0x0030) >> 4)];
}
uint8_t A32u4::InstHandler::getRd3_c_a16(uint16_t word) noexcept {//Rd 3Bit continous add 16
	return ((word & 0x0070) >> 4) + 16;
}
uint8_t A32u4::InstHandler::getRr3_c_a16(uint16_t word) noexcept {//Rr 3Bit continous add 16
	return (word & 0x0007) + 16;
}
uint8_t A32u4::InstHandler::getRd4_c(uint16_t word) noexcept {//Rd 4Bit continous add 16
	return ((word & 0x00F0) >> 4);
}
uint8_t A32u4::InstHandler::getRr4_c(uint16_t word) noexcept {//Rr 4Bit continous add 16
	return (word & 0x000F);
}
uint8_t A32u4::InstHandler::getRd4_c_a16(uint16_t word) noexcept {//Rd 4Bit continous add 16
	return getRd4_c(word) + 16;
}
uint8_t A32u4::InstHandler::getRr4_c_a16(uint16_t word) noexcept {//Rr 4Bit continous add 16
	return getRr4_c(word) + 16;
}
uint8_t A32u4::InstHandler::getRd4_c_m2(uint16_t word) noexcept {//Rd 4Bit continous add 16
	return getRd4_c(word) * 2;
}
uint8_t A32u4::InstHandler::getRr4_c_m2(uint16_t word) noexcept {//Rr 4Bit continous add 16
	return getRr4_c(word) * 2;
}
uint8_t A32u4::InstHandler::getRd5_c(uint16_t word) noexcept { //Rd 5Bit continous 
	return (word & 0b0000000111110000) >> 4;
}
uint8_t A32u4::InstHandler::getRr5_c(uint16_t word) noexcept { //Rr 5Bit continous 
	return ((word & 0b0000001000000000) >> 5) | (word & 0b0000000000001111);
}
uint8_t A32u4::InstHandler::getK6_d24(uint16_t word) noexcept {//K val 8Bit distributed in 4chunk 4chunk
	return ((word & 0x00C0) >> 2) | (word & 0x000F);
}
uint8_t A32u4::InstHandler::getK8_d44(uint16_t word) noexcept {//K val 8Bit distributed in 4chunk 4chunk
	return ((word & 0x0F00) >> 4) | (word & 0x000F);
}
uint8_t A32u4::InstHandler::getk7_c_sin(uint16_t word) noexcept {//k val 12Bit continuous signed
	return (int8_t)convTo16BitInt((word & 0b1111111000) >> 3, 7);
}
int16_t A32u4::InstHandler::getk12_c_sin(uint16_t word) noexcept {//k val 12Bit continuous signed
	return convTo16BitInt(word & 0xFFF, 12);
}
uint8_t A32u4::InstHandler::getb3_c(uint16_t word) noexcept {//b val 3Bit continuous
	return word & 0b111;
}
uint8_t A32u4::InstHandler::getA5_c(uint16_t word) noexcept {//A val 5Bit continuous
	return (word & 0b11111000) >> 3;
}
uint8_t A32u4::InstHandler::gets3_c(uint16_t word) noexcept {//s val 3Bit continuous
	return (word & 0b1110000) >> 4;
}
uint8_t A32u4::InstHandler::getq6_d123(uint16_t word) noexcept {//q val 6Bit distributed in 1chunk 2chunk 3chunk
	return ((word & 0x2000) >> 8) | ((word & 0x0C00) >> 7) | (word & 0x0007);
}
uint8_t A32u4::InstHandler::getA6_d24(uint16_t word) noexcept {//A val 6Bit distributed in 2chunk 4chunk ____ _AA_ ____ AAAA
	return ((word & 0x0600) >> (4 + 1)) | (word & 0x000F);
}

uint32_t A32u4::InstHandler::getLongAddr(uint16_t word1, uint16_t word2) noexcept {
	return (((uint32_t)(word1 & 0b0000000111110000)) << 13) | (((uint32_t)(word1 & 0b0000000000000001)) << 16) | word2; //could just use word2, but idk
}

