Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
bool A32u4::InstHandler::is2WordInst(uint16_t word) noexcept {
	//const uint16_t all = instList[IND_LDS].mask & instList[IND_STS].mask & instList[IND_JMP].mask & instList[IND_CALL].mask;

	//if ((word & all) != all) {
	//	return false;
	//}

	if ((word & instList[IND_LDS].mask) == instList[IND_LDS].res) {
		return true;
	}
	if ((word & instList[IND_STS].mask) == instList[IND_STS].res) {
		return true;
	}
	if ((word & instList[IND_JMP].mask) == instList[IND_JMP].res) {
		return true;
	}
	if ((word & instList[IND_CALL].mask) == instList[IND_CALL].res) {
		return true;
	}

	return false;
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::setPC_Cycs_Skip(ATmega32u4* mcu, bool cond) noexcept {
	if (cond) {
		if (!is2WordInst(mcu->flash.getInst(mcu->cpu.PC + 1))) {
			return inst_effect_t(2,2);
		}
		else {
			return inst_effect_t(3,3);
		}
	}
	else {
		return inst_effect_t(1,1);
	}
}

#define FLAG_MODULE mcu->dataspace

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ADD(ATmega32u4* mcu, uint16_t word) noexcept { //0000 11rd dddd rrrr
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t Rd_res = Rd + Rr;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_HSVNZC_ADD(Rd, Rr, 0, Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ADC(ATmega32u4* mcu, uint16_t word) noexcept { //0001 11rd dddd rrrr
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	uint8_t C = mcu->dataspace.sreg[DataSpace::Consts::SREG_C] != 0;

	uint8_t Rd_res = Rd + Rr + C;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_HSVNZC_ADD(Rd, Rr, C, Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ADIW(ATmega32u4* mcu, uint16_t word) noexcept { //1001 0110 KKdd KKKK
	const uint8_t d = getRd2_c_arr(word);
	const uint8_t K = getK6_d24(word);

	const uint16_t R16 = mcu->dataspace.getWordReg(d);
	const uint16_t R16_res = R16 + K;

	mcu->dataspace.setWordReg(d, R16_res);

	FLAG_MODULE.setFlags_SVNZC_ADD_16(R16,K,R16_res);
	return inst_effect_t(2,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SUB(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	uint8_t Rd_res = Rd - Rr;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, Rr, 0, Rd_res,false);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SUBI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd4_c_a16(word); //R16 to R31
	const uint8_t K = getK8_d44(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(d);

	const uint8_t Rd_res = Rd - K;

	mcu->dataspace.setGPReg_(d, Rd_res);

	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, K, 0, Rd_res,false);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBC(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t C = mcu->dataspace.sreg[DataSpace::Consts::SREG_C] != 0;

	const uint8_t Rd_res = Rd - (Rr + C); //Rd = Rd - Rr - C

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, Rr, C, Rd_res, true);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBCI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd4_c_a16(word); //R16 to R31
	const uint8_t K = getK8_d44(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(d);

	const uint8_t C = mcu->dataspace.sreg[DataSpace::Consts::SREG_C] != 0;

	const uint8_t Rd_res = Rd - (K + C); //Rd = Rd - K - C

	mcu->dataspace.setGPReg_(d, Rd_res);

	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, K, C, Rd_res,true);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBIW(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd2_c_arr(word);
	const uint8_t K = getK6_d24(word);

	const uint16_t R16 = mcu->dataspace.getWordReg(d);
	//uint16_t R16_copy = R16;
	//R16 -= K;
	const uint16_t R16_res = R16 - K;
	//mcu->dataspace.setWordReg(d, R16);
	mcu->dataspace.setWordReg(d, R16_res);

	//FLAG_MODULE.setFlags_SVNZC_SUB_16(R16_copy, K, R16);
	FLAG_MODULE.setFlags_SVNZC_SUB_16(R16, K, R16_res);
	return inst_effect_t(2,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_AND(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t Rd_res = Rd & Rr;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_SVNZ(Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ANDI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd4_c_a16(word); //R16 to R31
	const uint8_t K = getK8_d44(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(d);

	const uint8_t Rd_res = Rd & K;

	mcu->dataspace.setGPReg_(d, Rd_res);

	FLAG_MODULE.setFlags_SVNZ(Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_OR(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t Rd_res = Rd | Rr;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_SVNZ(Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ORI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd4_c_a16(word); //R16 to R31
	const uint8_t K = getK8_d44(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(d);

