Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
	const uint8_t Rd_res = Rd | K;

	mcu->dataspace.setGPReg_(d, Rd_res);

	FLAG_MODULE.setFlags_SVNZ(Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_EOR(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t Rd_res = Rd ^ Rr;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_SVNZ(Rd);
	return inst_effect_t(1,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_COM(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t& Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = 0xFF - Rd;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_SVNZC(Rd_res);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_NEG(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = 0x00 - Rd;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);


	FLAG_MODULE.setFlags_NZ(Rd_res);

	uint8_t res_h = 0x00 - (Rd & 0b1111);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_H] = isBitSetNB(res_h,4); // isBitSet(Rd,3) || !isBitSet(Rd_copy,3)

	const bool V = Rd_res == 0x80;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = V;
	const bool N = (Rd_res & 0b10000000) != 0;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = N ^ V;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = Rd_res != 0;

	return inst_effect_t(1,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_INC(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = Rd + 1;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_NZ(Rd_res);
	bool V = Rd_res == 0x80;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = V;
	bool N = (Rd_res & 0b10000000) != 0;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = N ^ V;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_DEC(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = Rd - 1;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	FLAG_MODULE.setFlags_NZ(Rd_res);
	bool V = (Rd_res ^ 0b10000000) == 0xFF;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = V;
	bool N = (Rd_res & 0b10000000) != 0;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = N ^ V;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SER(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd4_c_a16(word); //R16 to R31

	mcu->dataspace.setGPReg_(d, 0xFF);

	return inst_effect_t(1,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_MUL(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint16_t res = (uint16_t)Rd * (uint16_t)Rr;
	const uint8_t R0 = (uint8_t)res;
	const uint8_t R1 = (uint8_t)(res >> 8);

	mcu->dataspace.setGPReg_(0, R0);
	mcu->dataspace.setGPReg_(1, R1);
	
	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = isBitSetNB(R1, 7);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = res == 0;
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_MULS(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd4_c_a16(word);
	const uint8_t Rr_id = getRr4_c_a16(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const int16_t res = (int16_t)(int8_t)Rd * (int16_t)(int8_t)Rr;
	const uint8_t R0 = (uint8_t)res;
	const uint8_t R1 = (uint8_t)(res >> 8);

	mcu->dataspace.setGPReg_(0, R0);
	mcu->dataspace.setGPReg_(1, R1);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = isBitSetNB(R1, 7);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = res == 0;
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_MULSU(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd3_c_a16(word);
	const uint8_t Rr_id = getRr3_c_a16(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const int16_t res = (int16_t)(int8_t)Rd * (uint16_t)Rr;
	const uint8_t R0 = (uint8_t)res;
	const uint8_t R1 = (uint8_t)((uint16_t)res >> 8);

	mcu->dataspace.setGPReg_(0, R0);
	mcu->dataspace.setGPReg_(1, R1);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = isBitSetNB(R1, 7);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = res == 0;
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_FMUL(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd3_c_a16(word);
	const uint8_t Rr_id = getRr3_c_a16(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint16_t res = (uint16_t)Rd * (uint16_t)Rr;
	const int16_t res_sh = res << 1;
	const uint8_t R0 = (uint8_t)res_sh;
	const uint8_t R1 = (uint8_t)((uint16_t)res_sh >> 8);

	mcu->dataspace.setGPReg_(0, R0);
	mcu->dataspace.setGPReg_(1, R1);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = isBitSet(res, 15);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = res_sh == 0;
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_FMULS(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd3_c_a16(word);
	const uint8_t Rr_id = getRr3_c_a16(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const int16_t res = (int16_t)(int8_t)Rd * (int16_t)(int8_t)Rr;
	const int16_t res_sh = res << 1;
	const uint8_t R0 = (uint8_t)res_sh;
	const uint8_t R1 = (uint8_t)(res_sh >> 8);

	mcu->dataspace.setGPReg_(0, R0);
	mcu->dataspace.setGPReg_(1, R1);

