Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = isBitSet(res, 15);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = res_sh == 0;
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_FMULSU(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd3_c_a16(word);
	const uint8_t Rr_id = getRr3_c_a16(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const int16_t res = (int16_t)(int8_t)Rd * (uint16_t)Rr;
	const int16_t res_sh = res << 1;
	const uint8_t R0 = (uint8_t)res_sh;
	const uint8_t R1 = (uint8_t)((uint16_t)res_sh >> 8);

	mcu->dataspace.setGPReg_(0, R0);
	mcu->dataspace.setGPReg_(1, R1);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = isBitSet(res, 15);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = res_sh == 0;
	return inst_effect_t(2,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_RJMP(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(mcu);
	const int16_t k = getk12_c_sin(word);
	return inst_effect_t(2,k+1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_IJMP(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->cpu.PC = mcu->dataspace.getZ();
	return inst_effect_t(2,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_EIJMP(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->cpu.PC = mcu->dataspace.getZ(); //PC should have bits 21:16 set to reg EIND but PC is only 16bit and EIND doesnt seem to exist, soooo
	return inst_effect_t(2,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_JMP(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint16_t word2 = mcu->flash.getInst(mcu->cpu.PC + 1);
	const uint32_t k = getLongAddr(word,word2); 

	mcu->cpu.PC = k; 

	return inst_effect_t(3,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_RCALL(ATmega32u4* mcu, uint16_t word) noexcept {
	const int16_t k = getk12_c_sin(word);

	mcu->dataspace.pushAddrToStack(mcu->cpu.PC+1);

	mcu->debugger.pushPCOnCallStack(mcu->cpu.PC+k+1, mcu->cpu.PC);
	
	return inst_effect_t(4,k+1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ICALL(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.pushAddrToStack(mcu->cpu.PC + 1);

	const uint16_t addr = mcu->dataspace.getZ();

	mcu->debugger.pushPCOnCallStack(addr, mcu->cpu.PC);

	mcu->cpu.PC = addr;

	return inst_effect_t(4,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_EICALL(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.pushAddrToStack(mcu->cpu.PC + 1);

	const uint16_t addr = mcu->dataspace.getZ();

	mcu->debugger.pushPCOnCallStack(addr, mcu->cpu.PC);

	mcu->cpu.PC = addr;

	return inst_effect_t(4,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CALL(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint16_t word2 = mcu->flash.getInst(mcu->cpu.PC + 1);
	const uint32_t k = getLongAddr(word, word2);

	mcu->dataspace.pushAddrToStack(mcu->cpu.PC + 2);

	mcu->debugger.pushPCOnCallStack(k, mcu->cpu.PC);

	mcu->cpu.PC = k;

	return inst_effect_t(5,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_RET(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	const uint16_t addr = mcu->dataspace.popAddrFromStack();
	mcu->cpu.PC = addr;

	//     \/ is now handled automatically inside mcu->dataspace.popAddrFromStack();
	//mcu->debugger.popPCFromCallStack(); 

	return inst_effect_t(5,0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_RETI(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	const uint16_t addr = mcu->dataspace.popAddrFromStack();
	mcu->cpu.PC = addr;

	mcu->dataspace.sreg[DataSpace::Consts::SREG_I] = 1;

	//mcu->debugger.popPCFromCallStack();

	mcu->cpu.insideInterrupt = false;

	return inst_effect_t(5,0);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CPSE(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	return setPC_Cycs_Skip(mcu, Rd == Rr);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CP(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	
	const uint8_t res = Rd - Rr;
	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, Rr, 0, res,false);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CPC(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t C = mcu->dataspace.sreg[DataSpace::Consts::SREG_C] != 0;

	const uint8_t res = Rd - (Rr+C);
	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, Rr, C, res,true);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CPI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t d = getRd4_c_a16(word); //R16 to R31
	const uint8_t K = getK8_d44(word);

	const uint8_t Rd = mcu->dataspace.getGPReg_(d);

	const uint8_t res = Rd - K;
	FLAG_MODULE.setFlags_HSVNZC_SUB(Rd, K, 0, res, false);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBRC(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint8_t b = getb3_c(word);

	return setPC_Cycs_Skip(mcu, (Rr & (1<<b)) == 0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBRS(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint8_t b = getb3_c(word);

	return setPC_Cycs_Skip(mcu, (Rr & (1 << b)) != 0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBIC(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t A = getA5_c(word);
	const uint8_t b = getb3_c(word);

