Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
	const uint8_t ioReg = mcu->dataspace.getIOAt(A);
	//uint8_t ioReg = mcu->dataspace.data[DataSpace::Consts::io_start + A];
	return setPC_Cycs_Skip(mcu, (ioReg & (1 << b)) == 0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBIS(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t A = getA5_c(word);
	const uint8_t b = getb3_c(word);

	const uint8_t ioReg = mcu->dataspace.getIOAt(A);
	//uint8_t ioReg = mcu->dataspace.data[DataSpace::Consts::io_start + A];
	return setPC_Cycs_Skip(mcu, (ioReg & (1 << b)) != 0);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BRBS(ATmega32u4* mcu, uint16_t word) noexcept {
	const int8_t k = (int8_t)getk7_c_sin(word);
	const uint8_t s = getb3_c(word);

	if (mcu->dataspace.sreg[s]) {
		return inst_effect_t(2,k + 1);
	}else {
		return inst_effect_t(1,1);
	}
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BRBC(ATmega32u4* mcu, uint16_t word) noexcept {
	const int8_t k = (int8_t)getk7_c_sin(word);
	const uint8_t s = getb3_c(word);

	if (mcu->dataspace.sreg[s] == false) {
		return inst_effect_t(2,k + 1);
	}
	else {
		return inst_effect_t(1,1);
	}
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SBI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t A = getA5_c(word);
	const uint8_t b = getb3_c(word);

	uint8_t io = mcu->dataspace.getIOAt(A);
	io |= 1 << b;
	
	//mcu->dataspace.setRegBit(mcu->dataspace.data[DataSpace::Consts::io_start + A], b, true);
	mcu->dataspace.setIOAt(A, io);
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CBI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t A = getA5_c(word);
	const uint8_t b = getb3_c(word);

	//mcu->dataspace.setRegBit(mcu->dataspace.data[DataSpace::Consts::io_start + A], b, false);

	uint8_t io = mcu->dataspace.getIOAt(A);
	io &= ~(1 << b);

	mcu->dataspace.setIOAt(A, io);
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LSR(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = Rd >> 1;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	bool C = Rd&0b1;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = C;
	bool N = 0;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_N] = N;
	bool V = N ^ C;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = V;
	bool S = N ^ V;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = S;

	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = Rd_res == 0;
	
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ROR(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = (Rd >> 1) | ((mcu->dataspace.sreg[DataSpace::Consts::SREG_C] != 0) << 7);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	bool C = Rd & 0b1;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = C;
	bool N = isBitSet(Rd_res,7);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_N] = N;
	bool V = N ^ C;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = V;
	bool S = N ^ V;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = S;

	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = Rd_res == 0;

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ASR(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = (int8_t)Rd >> 1; //hopyfully this works
	//Rd |= Rd_copy & 0b10000000;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	bool C = Rd & 0b1;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = C;
	bool N = isBitSet(Rd_res, 7);
	mcu->dataspace.sreg[DataSpace::Consts::SREG_N] = N;
	bool V = N ^ C;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = V;
	bool S = N ^ V;
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = S;

	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = Rd_res == 0;

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SWAP(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);

	const uint8_t Rd_res = ((Rd&0xF0)>>4) | ((Rd&0xF)<<4);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BSET(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t s = gets3_c(word);

	mcu->dataspace.sreg[s] = 1;

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BCLR(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t s = gets3_c(word);

	mcu->dataspace.sreg[s] = 0;

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BST(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t b = getb3_c(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_T] = isBitSetNB(Rd,b);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BLD(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint8_t b = getb3_c(word);

	const bool T = mcu->dataspace.sreg[DataSpace::Consts::SREG_T];

	uint8_t Rd_res;
#if 0
	if (T) {
		Rd_res = Rd | (1 << b);
	}
	else {
		Rd_res = Rd & ~(1 << b);
	}
#else
	Rd_res = Rd ^ ((-(uint8_t)T ^ Rd) & (1 << b));
#endif
	
	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(1,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SEC(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLC(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_C] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SEN(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_N] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLN(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_N] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SEZ(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLZ(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_Z] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SEI(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

