Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
	mcu->dataspace.sreg[DataSpace::Consts::SREG_I] = 1;
	mcu->cpu.breakOutOfOptim = true; // break out of optimisation to check for execution of interrupts (Global Interrupt Enable)
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLI(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_I] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SES(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLS(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);
	
	mcu->dataspace.sreg[DataSpace::Consts::SREG_S] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SEV(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLV(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_V] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SET(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_T] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLT(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_T] = 0;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SEH(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_H] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CLH(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	mcu->dataspace.sreg[DataSpace::Consts::SREG_H] = 0;
	return inst_effect_t(1,1);
}

A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SE_(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	const uint8_t s = gets3_c(word);

	mcu->dataspace.sreg[s] = 1;
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_CL_(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);

	const uint8_t s = gets3_c(word);

	mcu->dataspace.sreg[s] = 0;
	return inst_effect_t(1,1);
}


A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_MOV(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rr_id = getRr5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	const uint8_t Rd_res = Rr;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_MOVW(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd4_c_m2(word);
	const uint8_t Rr_id = getRr4_c_m2(word);

	mcu->dataspace.setGPReg_(Rd_id, mcu->dataspace.getGPReg_(Rr_id));
	mcu->dataspace.setGPReg_(Rd_id+1, mcu->dataspace.getGPReg_(Rr_id+1));

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LDI(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd4_c_a16(word);
	const uint8_t K = getK8_d44(word);

	const uint8_t Rd_res = K;

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_X(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getX();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_XpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getX();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	mcu->dataspace.setX(Addr + 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_XpreDec(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getX();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr - 1);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	mcu->dataspace.setX(Addr - 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_Y(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getY();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_YpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getY();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	mcu->dataspace.setY(Addr + 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_YpreDec(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getY();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr - 1);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	mcu->dataspace.setY(Addr - 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LDD_Y(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t q = getq6_d123(word);
	const uint16_t Addr = mcu->dataspace.getY() + q;

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_Z(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getZ();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_ZpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getZ();

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	mcu->dataspace.setZ(Addr + 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LD_ZpreDec(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getZ();

