Julianiolo/ATmega32u4_Emulator/src/components/InstHandler.cpp
	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr - 1);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	mcu->dataspace.setZ(Addr - 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LDD_Z(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t q = getq6_d123(word);
	const uint16_t Addr = mcu->dataspace.getZ() + q;

	const uint8_t Rd_res = mcu->dataspace.getByteAt(Addr);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LDS(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint16_t word2 = mcu->flash.getInst(mcu->cpu.PC + 1);
	const uint8_t Rd_id = getRd5_c(word);
	const uint16_t k = word2;

	const uint8_t Rd_res = mcu->dataspace.getByteAt(k);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,2);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_X(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getX();
	
	mcu->dataspace.setByteAt(Addr, Rr);
	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_XpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getX();

	mcu->dataspace.setByteAt(Addr, Rr);

	mcu->dataspace.setX(Addr + 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_XpreDec(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getX();

	mcu->dataspace.setByteAt(Addr - 1, Rr);

	mcu->dataspace.setX(Addr - 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_Y(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getY();

	mcu->dataspace.setByteAt(Addr, Rr);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_YpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getY();

	mcu->dataspace.setByteAt(Addr, Rr);

	mcu->dataspace.setY(Addr + 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_YpreDec(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getY();

	mcu->dataspace.setByteAt(Addr - 1, Rr);

	mcu->dataspace.setY(Addr - 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_STD_Y(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint8_t q = getq6_d123(word);
	const uint16_t Addr = mcu->dataspace.getY() + q;

	mcu->dataspace.setByteAt(Addr, Rr);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_Z(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getZ();

	mcu->dataspace.setByteAt(Addr, Rr);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_ZpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getZ();

	mcu->dataspace.setByteAt(Addr, Rr);

	mcu->dataspace.setZ(Addr + 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ST_ZpreDec(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint16_t Addr = mcu->dataspace.getZ();

	mcu->dataspace.setByteAt(Addr - 1, Rr);

	mcu->dataspace.setZ(Addr - 1);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_STD_Z(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint8_t q = getq6_d123(word);
	const uint16_t Addr = mcu->dataspace.getZ() + q;

	mcu->dataspace.setByteAt(Addr, Rr);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_STS(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint16_t word2 = mcu->flash.getInst(mcu->cpu.PC + 1);
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t Rd = mcu->dataspace.getGPReg_(Rd_id);
	const uint16_t k = word2;

	mcu->dataspace.setByteAt(k, Rd);

	return inst_effect_t(2,2);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LPM_0(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);
	const uint16_t Addr = mcu->dataspace.getZ();

	const uint8_t R0 = mcu->flash.getByte(Addr);

	mcu->dataspace.setGPReg_(0, R0);

	return inst_effect_t(3,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LPM_d(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getZ();

	const uint8_t Rr_res = mcu->flash.getByte(Addr);

	mcu->dataspace.setGPReg_(Rr_id, Rr_res);

	return inst_effect_t(3,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_LPM_dpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint16_t Addr = mcu->dataspace.getZ();

	const uint8_t Rr_res = mcu->flash.getByte(Addr);

	mcu->dataspace.setGPReg_(Rr_id, Rr_res);

	mcu->dataspace.setZ(Addr + 1);

	return inst_effect_t(3,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ELPM_0(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);
	const uint32_t Addr = mcu->dataspace.getExtendedZ();

	const uint8_t R0 = mcu->flash.getByte(Addr);

	mcu->dataspace.setGPReg_(0, R0);

	return inst_effect_t(3,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ELPM_d(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint32_t Addr = mcu->dataspace.getExtendedZ();

	const uint8_t Rr_res = mcu->flash.getByte(Addr);

	mcu->dataspace.setGPReg_(Rr_id, Rr_res);

	return inst_effect_t(3,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_ELPM_dpostInc(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint32_t Addr = mcu->dataspace.getExtendedZ();

	const uint8_t Rr_res = mcu->flash.getByte(Addr);

	mcu->dataspace.setGPReg_(Rr_id, Rr_res);

	mcu->dataspace.setZ(Addr + 1);

	return inst_effect_t(3,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SPM(ATmega32u4* mcu, uint16_t word) noexcept {
	//TODO

	return inst_effect_t(0,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_IN(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);
	const uint8_t A = getA6_d24(word);

	const uint8_t Rd_res = mcu->dataspace.getIOAt(A);

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_OUT(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);
	const uint8_t A = getA6_d24(word);

	mcu->dataspace.setIOAt(A, Rr);

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_PUSH(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rr_id = getRd5_c(word);
	const uint8_t Rr = mcu->dataspace.getGPReg_(Rr_id);

	mcu->dataspace.pushByteToStack(Rr);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_POP(ATmega32u4* mcu, uint16_t word) noexcept {
	const uint8_t Rd_id = getRd5_c(word);

	const uint8_t Rd_res = mcu->dataspace.popByteFromStack();

	mcu->dataspace.setGPReg_(Rd_id, Rd_res);

	return inst_effect_t(2,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_NOP(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(mcu);
	MCU_UNUSED(word);
	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_SLEEP(ATmega32u4* mcu, uint16_t word) noexcept {
	MCU_UNUSED(word);
	
	//TODO
	uint8_t SMCR_val = mcu->dataspace.getByteAt(DataSpace::Consts::SMCR);
	if (SMCR_val & 0b1) { //if SE (sleep enable) is set
		switch ((SMCR_val >> 1) & 0b111) {
		case 0: //idle
			mcu->cpu.CPU_sleep = true;
			mcu->cpu.breakOutOfOptim = true;
			break;
		default:
			break;
		}
	}
	

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_WDR(ATmega32u4* mcu, uint16_t word) noexcept {
	//TODO

	return inst_effect_t(1,1);
}
A32u4::InstHandler::inst_effect_t A32u4::InstHandler::INST_BREAK(ATmega32u4* mcu, uint16_t word) noexcept {
	//TODO
	mcu->debugger.halt();

	return inst_effect_t(1,1);
}
